Fujifilm ได้เปิดตัวกล้องคอมแพ็กต์รุ่นใหม่ล่าสุดกับ Fujifilm X-30 กล้องคอมแพ็กต์ระดับโปรรุ่นใหม่ที่มาพร้อมกับฟีเจอร์การถ่ายภาพระดับมืออาชีพ โดยกล้อง Fujifilm X-30 
มาพร้อมกับวิวไฟน์เดอร์แบบอิเล็กทรอนิกส์ที่ให้ภาพสมจริง พร้อมกับปรับปรุงในส่วนของดีไซน์แป้นหมุนเป็นแบบ 2 แป้นเพื่อการควบคุมกล้องที่ง่ายดายและสะดวกมากขึ้น ด้วยคุณภาพของเซ็นเซอร์ขนาด 2/3 นิ้ว 
ความละเอียด 12 ล้านพิกเซล และระบบประมวลผล EXR Processor II ให้คุณภาพไฟล์ที่ยอดเยี่ยม มาพร้อมหน้าจอขนาด 3 นิ้วบิดพับได้ เลนส์ซูมคุณภาพสูงเทียบเท่า 28–112 mm F2.0-2.8 
มีระบบป้องกันภาพสั่นไหวในตัว ปรับตั้ง ISO ได้ 100-12800 และสามารถบันทึกภาพแบบ RAW ได้ สำหรับกล้อง Fujifilm X-30 เปิดตัวด้วยราคา $599 หรือประมาณ 18,000 บาท



<ul>สเปค Fujifilm X-A10 แบบละเอียด

<li>16.3 megapixel APS-C CMOS
<li>iso 200-6400 (ขยายได้ 100-25600)
<li>โฟกัส 49 จุด พร้อม Face Detection และ Eye Detection
<li>ระบบวัดแสง 256 Zone
<li>Sync Flash Speed 1/180
<li>วิดิโอ Full HD 30 Fps
<li>ถ่ายได้ต่อเนื่อง 6 ภาพต่อวินาที (สูงสุด 20 ภาพ)
<li>Speed Shutter ความเร็วสูงสุด 1/32000 วินาที
<li>Film Simulation 6 แบบ (Provia/Standard, Velvia/Vivid, Astia/Soft, Classic Chrome, Mono Chrome)
<li>Advances Filter
<li>Wi-Fi สามารถใช้งานรีโมทได้ผ่านแอพ
<li>แบตเตอรี่รุ่นใหม่ NP-W12P ใช้ได้ 410 ภาพ ต่อการชาร์จ 1 ครั้ง
<li>น้ำหนัก 331 กรัม รวมน้ำหนักแบตและ Memory
<li>ใช้ SD Card ความเร็ว UHS-I
</ul>