Fujifilm X-A1 เป็นกล้องดิจิตอลใน Fujifilm X-Series เปิดตัวออกมาพร้อมกับตัวเครื่องน้ำหนักเบาพกพาง่าย ใช้เซ็นเซอร์รับภาพ CMOS 
ความละเอียด 16.3 ล้านพิกเซล และ Wi-Fi ในตัวสามารถแชร์ภาพไปยังโซเชียลเน็ตเวิร์คต่างๆ ได้ ในส่วนของจอภาพมาพร้อมกับจอภาพที่สามารถปรับพับได้ ขนาด 3 นิ้ว 
ความละเอียด 920,000 พิกเซล ความเร็วชัดเตอร์ 30-1/4000 วินาที ค่าความไวแสง(iSO) 200 – 6400 ขนาดภาพใหญ่สุด 4896 x 3264 พิกเซล รองรับการบันทึกวิดีโอที่ความละเอียด 1920 x 1080 30p

นอกจากนั้นแล้ว Fujifilm X-A1 ยังได้เปิดตัวออกมาพร้อมกับเลนส์ FUJINON XC16-50มม. F3.5-5.6 OIS (24-76 มม. เทียบกล้องฟิล์ม) ภายในประกอบไปด้วยชิ้นเลนส์จำนวน 12 ชิ้น แบ่งเป็น 10 กลุ่ม มีเลนส์ aspherical 3 ชิ้น มีเลนส์ ED 1 ชิ้น ในส่วนของสเปคกล้อง Fujifilm X-A1


Fujifilm X-A1 สเปค <!-- เอาไว้ก่อน
– เซ็นเซอร์ APS-C แบบ CMOS
– ความละเอียด 16 ล้านพิกเซล
– ขนาดภาพใหญ่สุด 4896 x 3264 พิกเซล
– ชิปประมวลผลภาพ EXR Processor II
– ความไวแสง (ISO) ISO200 – 6400
– สมดุลแสงสีขาว White balance presets 7
– ระบบกันสั่น OIS
– รองรับการบันทึกภาพไฟล์ RAW
– จอภาพ TFT-LCD สามารถปรับพับได้ ขนาด 3 นิ้วความละเอียด 920,000 พิกเซล
– ความเร็วชัดเตอร์ 30-1/4000 วินาที
– แฟลชในตัว ระยะ 7 ม.
– รองรับแฟลชภายนอก TTL Flash
– บันทึกวิดีโอ 1920 x 1080 30p ไฟล์ H.264
– รองรับ USB 2.0
– รองรับ Mini HDMI Type C
– Wireless ในตัว
– แบตเตอรี่รุ่น NP-W126
– ตัวเครื่องขนาด 117 x 67 x 39 มม.
– หนัก 330 กรัม -->